#### Terraform fmt `success`, init `success`, plan `success`
<details><summary>Show Plan</summary>

```
terraform
ec_deployment.onweek_demo: Refreshing state... [id=b182e085c8da8da5f11de1a58a9d404e]
elasticstack_auth_user.onweek_demo_user: Refreshing state... [id=onweek_demo_user]
elasticstack_fleet_agent_policy.endpoint_1: Refreshing state... [id=onweek-endpoint-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lightsail_instance.onweek_windows_test_3 will be created
  + resource "aws_lightsail_instance" "onweek_windows_test_3" {
      + arn                = (known after apply)
      + availability_zone  = "us-east-1a"
      + blueprint_id       = "windows_server_2019"
      + bundle_id          = "micro_win_2_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "onweek_windows_test_3"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + user_data          = (sensitive)
      + username           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @tsouza, Action: `pull_request`*